Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/energy_and_water_services/commission_for_energy_regulation.html.txt.tmx
Source language: en
Languages: ga

source: Commission for Energy Regulation
ga: An Coimisiún um Rialáil Fuinnimh

source: The regulator for the electricity and natural gas markets in Ireland is the Commission for Energy Regulation (CER)
ga: Is é an rialtóir do mhargaí leictreachais agus gáis nádúrtha in Éirinn ná an Coimisiún um Rialáil Fuinnimh (CRF)

source: It was initially established in 1999 under the Electricity Regulation Act 1999
ga: Bunaíodh é ar dtús in 1999 faoin Acht um Rialáil Leictreachais 1999

source: Since then it has had additional functions added to it under other legislation, such as under the Gas (Interim) (Regulation) Act 2002
ga: Ó shin i leith, tá feidhmeanna eile curtha leis faoi reachtaíocht eile, cosúil leis na feidhmeanna faoin Acht Gáis (Eatramhach) (Rialáil) 2002

source: Under the Water Services Act 2013, it is the regulator for public water and wastewater services
ga: Faoin Acht um Sheirbhísí Uisce 2013, is é an rialtóir le haghaidh seirbhísí uisce agus fuíolluisce poiblí

source: CER promotes competition in the electricity and natural gas sectors
ga: Spregann CRF iomaíocht sna hearnálacha leictreachais agus gáis nádúrtha

source: It also protects the interests of customers, especially the disadvantaged and the elderly, by ensuring that standards of services are set and codes of practices are in place
ga: Déanann sé leas na gcustaiméirí a chosaint chomh maith, go háirithe daoine faoi mhíbhuntáiste agus daoine breacaosta, trí chinntiú go bhfuil caighdeáin na seirbhísí socraithe agus cód chleachtais curtha i bhfeidhm

source: CER licences electricity and natural gas companies and sets performance standards which it enforces
ga: Tugann CRF ceadúnais do chomhlachtaí leictreachais agus gáis nádúrtha, agus leagann sé síos caighdeáin feidhmíochta a dhéanann sé a fhorghníomhú

source: It tries to ensure that the supply of natural gas and electricity to customers is safe, secure and reliable
ga: Déanann an Coimisiún iarracht a chinntiú go bhfuil soláthar an gháis nádúrtha agus leictreachais do chustaiméirí sábháilte, slán agus iontaofa

source: Along with the Northern Ireland Authority for Utility Regulation (NIAUR) CER runs the All-Island Project, the aim of which is to create a single market for natural gas and electricity on the island of Ireland
ga: In éineacht leis an Northern Ireland Authority for Utility Regulation (NIAUR), reáchtálann an CRF Tionscadal Uile-Oileáin, agus í mar aidhm margadh aonair a chruthú do ghás nádúrtha agus leictreachas ar oileán na hÉireann

source: The CER has established an Energy Customers Team to assist customers who are having issues with their supplier or network operator
ga: Tá an CER Foireann Custaiméirí Fuinnimh arna bunú chun cabhrú le custaiméirí a bhfuil ceisteanna lena soláthraí nó oibreoir líonra

source: The Energy Customers Team provides an independent complaints resolution service for customers who have used their supplier or network operator’s complaints handling process and are not satisfied with the outcome
ga: Soláthraíonn an Fhoireann Custaiméirí Fuinnimh seirbhís neamhspleách gearáin a réiteach do chustaiméirí a bhain úsáid as a soláthraí nó oibreoir líonra ar phróiseas láimhsithe gearán agus nach bhfuil sásta leis an toradh

source: More information can be found on the Commission’s website
ga: Is féidir tuilleadh eolais a fháil ar láithreán gréasáin an Choimisiúin
